<script setup>
    /* Layouts */
    import AppPublicPageWrapper from '@/Layouts/AppPublicPageWrapper.vue';

    import BaseAccordion from '@/Components/Base/BaseAccordion.vue';
    let props = defineProps({
        user: Object,
        response: Object,
    });

    const faq = [
        {
            header: "Ποιό είναι το επόμενο βήμα;",
            content: "Ο/Η σύμβουλος επαγγελματικού προσανατολισμού, θα επικοινωνήσει άμεσα μαζί σου, στο θα Θα ενημερωθείς μέσω email ή τηλέφωνο για την επιβεβαίωση της συνεδρίας."
        },

        {
            header: "Τι είναι το project FutureGeneration;",
            content: "Ένας εθελοντικός οργανισμός με στόχο να σε βοηθήσει να αποκτήσεις την γνώση και τα εργαλεία εκείνα που χρειάζεσαι."
        },

        {
            header: "Πρέπει να αγχώνεσαι;",
            content: "Όχι, η διαδικασία αυτή έχει ως στόχο να σε εξελίξει. Ζούμε σε μια κοινωνία όπου η απομόνωση έχει δημιουργήσει διάφορα θέματα. Το στρες και το άγχος είναι καθημερινά και είναι απολύτως φυσιολογικό να έχεις δεύτερες σκέψεις."
        },

        {
            header: "Γιατί είναι δωρεάν, μήπως κρύβεται κάποια απάτη;",
            content: "Το project FutureGeneration, λειτουργεί με εθελοντικό χαρακτήρα. Αυτό σημαίνει πως υπάρχει τόσο υλικό όσο και υπηρεσίες εντελώς δωρεάν. Για την εξασφάλιση της βιωσιμότηττάς του, στο μέλλον, μπορεί κάποια προϊόταν ή υπηρεσίες να είναι επι πληρωμή αλλά αυτό θα είναι κάτι που θα δηλώνεται ρητά και θα είναι προαιρετικό για τον χρήστη."
        }
    ]
</script>

<template>
    <AppPublicPageWrapper>
        <template #page-title>
            Επιτυχής Υποβολή Συνεδρίας
        </template>

        <template #page-subtitle>
            
        </template>

        <template #page-content>
            <Message severity="success">
                <h4 class="mb-0">Επιτυχής υποβολή της αίτησης</h4>
            </Message>
<!-- 
            <div class="flex flex-col">
                <div style="min-width: 60px; ">
                    <svg class="w-26 h-26" fill="none" stroke="#22C55E" viewBox="0 0 22 22" xmlns="https://www.w3.org/2000/svg">
                        <path stroke-linecap="round" stroke-linejoin="round" stroke-width="1" d="M9 12l2 2 4-4M7.835 4.697a3.42 3.42 0 001.946-.806 3.42 3.42 0 014.438 0 3.42 3.42 0 001.946.806 3.42 3.42 0 013.138 3.138 3.42 3.42 0 00.806 1.946 3.42 3.42 0 010 4.438 3.42 3.42 0 00-.806 1.946 3.42 3.42 0 01-3.138 3.138 3.42 3.42 0 00-1.946.806 3.42 3.42 0 01-4.438 0 3.42 3.42 0 00-1.946-.806 3.42 3.42 0 01-3.138-3.138 3.42 3.42 0 00-.806-1.946 3.42 3.42 0 010-4.438 3.42 3.42 0 00.806-1.946 3.42 3.42 0 013.138-3.138z"></path>
                    </svg>
                </div>
                
                <h4 class="ml-4">
                    Επιτυχής υποβολή της αίτησης
                </h4>
            </div> -->

            <p>
                Σε αυτό το σημείο, έχεις ολοκληρώσει την υποβολή της δωρεάν συνεδρίας επαγγελματικού προσανατολισμού. Σε λίγα λεπτά, θα πρέπει να έχεις λάβει ένα email επιβεβαίωσης. Θυμήσου να κοιτάξεις και τα spam.
            </p>

            <h3 class="text-2xl">
                Μήπως έχεις απορίες;
            </h3>

            <BaseAccordion
                :accordionTabs="faq"
            />
            
            <h3 class="text-2xl">
                Συντονίσου μαζί μας
            </h3>
            
            <p>Κάνε ένα follow το social που χρησιμοποιείς περισσότερο και μείνει συντονισμένος/η με όλα τα tips και το υλικό που ανεβάζουμε!</p>
            
            <div class="text-center mb-4 mt-5">
                <div class="flex flex-row justify-center">
                    <div class="px-2">
                        <a class="social-media-link" href="https://www.facebook.com/TEDxMaviliSquare/?locale=el_GR" target="_blank">
                            <svg class="w-3 h-3" fill="#323232" stroke="#cbd5e1" xmlns="https://www.w3.org/2000/svg" viewBox="0 0 448 512">
                                <path d="M80 299.3V512H196V299.3h86.5l18-97.8H196V166.9c0-51.7 20.3-71.5 72.7-71.5c16.3 0 29.4 .4 37 1.2V7.9C291.4 4 256.4 0 236.2 0C129.3 0 80 50.5 80 159.4v42.1H14v97.8H80z"/>
                            </svg>
                        </a> 
                    </div>

                    <div class="px-2">
                        <a class="social-media-link" href="https://www.linkedin.com/company/tedxmavilisquare/?originalSubdomain=gr" target="_blank">
                            <svg class="w-3 h-3" fill="#323232" stroke="#bef264" xmlns="https://www.w3.org/2000/svg" viewBox="0 0 448 512">
                                <path d="M100.3 448H7.4V148.9h92.9zM53.8 108.1C24.1 108.1 0 83.5 0 53.8a53.8 53.8 0 0 1 107.6 0c0 29.7-24.1 54.3-53.8 54.3zM447.9 448h-92.7V302.4c0-34.7-.7-79.2-48.3-79.2-48.3 0-55.7 37.7-55.7 76.7V448h-92.8V148.9h89.1v40.8h1.3c12.4-23.5 42.7-48.3 87.9-48.3 94 0 111.3 61.9 111.3 142.3V448z"/>
                            </svg>
                        </a>
                    </div>

                    <div class="px-2">
                        <a class="social-media-link" href="https://www.instagram.com/challenge/?next=https%3A%2F%2Fwww.instagram.com%2Ftedxmavilisquare%2F%3F__coig_challenged%3D1" target="_blank">
                            <svg class="w-3 h-3" fill="#323232" stroke="#bef264" xmlns="https://www.w3.org/2000/svg" viewBox="0 0 448 512">
                                <path d="M224.1 141c-63.6 0-114.9 51.3-114.9 114.9s51.3 114.9 114.9 114.9S339 319.5 339 255.9 287.7 141 224.1 141zm0 189.6c-41.1 0-74.7-33.5-74.7-74.7s33.5-74.7 74.7-74.7 74.7 33.5 74.7 74.7-33.6 74.7-74.7 74.7zm146.4-194.3c0 14.9-12 26.8-26.8 26.8-14.9 0-26.8-12-26.8-26.8s12-26.8 26.8-26.8 26.8 12 26.8 26.8zm76.1 27.2c-1.7-35.9-9.9-67.7-36.2-93.9-26.2-26.2-58-34.4-93.9-36.2-37-2.1-147.9-2.1-184.9 0-35.8 1.7-67.6 9.9-93.9 36.1s-34.4 58-36.2 93.9c-2.1 37-2.1 147.9 0 184.9 1.7 35.9 9.9 67.7 36.2 93.9s58 34.4 93.9 36.2c37 2.1 147.9 2.1 184.9 0 35.9-1.7 67.7-9.9 93.9-36.2 26.2-26.2 34.4-58 36.2-93.9 2.1-37 2.1-147.8 0-184.8zM398.8 388c-7.8 19.6-22.9 34.7-42.6 42.6-29.5 11.7-99.5 9-132.1 9s-102.7 2.6-132.1-9c-19.6-7.8-34.7-22.9-42.6-42.6-11.7-29.5-9-99.5-9-132.1s-2.6-102.7 9-132.1c7.8-19.6 22.9-34.7 42.6-42.6 29.5-11.7 99.5-9 132.1-9s102.7-2.6 132.1 9c19.6 7.8 34.7 22.9 42.6 42.6 11.7 29.5 9 99.5 9 132.1s2.7 102.7-9 132.1z"/>
                            </svg>
                        </a>
                    </div>
                </div>
            </div>
        </template>
    </AppPublicPageWrapper>
</template>
