<script setup>
    import TheSectionHeader from '@/Pages/Static/Landing/TheSectionHeader.vue';
    import SectionLayout from '@/Pages/Static/Landing/SectionLayout.vue';



const faqList = [
    {
        question: "Πόσο ακριβές είναι αυτό το Τεστ Επαγγελματικού Προσανατολισμού;",
        answer: "Το Τεστ Επαγγελματικού Προσανατολισμού του CareerExplorer, βασίζεται σε επιστημονικά εργαλεία και μεθόδους που έχουν αναπτυχθεί για να παρέχουν εξατομικευμένα και αξιόπιστα αποτελέσματα. Βασίζονται στην θεωρία του John Holland. Φυσικά, τα αποτελέσματα, προσαρμόζονται στις μοναδικές σου δεξιότητες, ενδιαφέροντα και προτιμήσεις.",
    },
    {
        question: "Είναι το Τεστ Επαγγελματικού Προσανατολισμού δωρεάν ή επί πληρωμή;",
        answer: "Το Τεστ Επαγγελματικού Προσανατολισμού είναι και θα είναι δωρεάν για όλους τους χρήστες. Φυσικά υπάρχει η δυνατότητα για επιπλέον υποστήριξη και προσωπική συμβουλευτική, υπηρεσία που παρέχεται επι-πληρωμή.",
    },
    {
        question: "Πόσο χρόνο χρειάζεται για να ολοκληρωθεί το Τεστ Επαγγελματικού Προσανατολισμού;",
        answer: "Το Τεστ Επαγγελματικού Προσανατολισμού, είναι γρήγορο και αποτελεσματικό, συνήθως διαρκεί περίπου 10-15 λεπτά. Παρέχει άμεση πρόσβαση στα αποτελέσματα μόλις ολοκληρωθεί.",
    },
    {
        question: "Πώς θα λάβω πρακτικές συμβουλές για την καριέρα μου;",
        answer: "Μπορείς να κάνεις εντελώς δωρεάν εγγραφή με το email σου. Έτσι θα λαμβάνεις tips και συμβουλές στο email σου. Θέλεις περισσότερα; Κάνε join στον εθελοντικό οργανισμό του FutureGeneration που συντονίζει και οργανώνει την όλη δράση. Εκεί το mindset σου θα πάει σε άλλο επίπεδο.",
    },
    {
        question: "Θα έχω άμεση πρόσβαση στα αποτελέσματα;",
        answer: "Ναι, τα αποτελέσματα του τεστ εμφανίζονται αμέσως μετά την ολοκλήρωση του. Δεν χρειάζεται να περιμένετε ή να κατεβάσετε κάποιο email.",
    },
    {
        question: "Πώς μπορώ να χρησιμοποιήσω τα αποτελέσματα του τεστ στην επαγγελματική μου πορεία;",
        answer: "Τα αποτελέσματα του τεστ μπορούν να σου παρέχουν πολύτιμες πληροφορίες για να κατανοήσεις τα δυνατά σου σημεία και περιοχές ανάπτυξης. Μπορείς να τα χρησιμοποιήσεις για να κατευθύνεις την επαγγελματική σου κατεύθυνση και να αναζητήσεις θέσεις εργασίας ή εκπαιδευτικά προγράμματα που ευθυγραμμίζονται με τα ενδιαφέροντά σου και τις δεξιότητές σου. Εάν χρειάζεσαι επιπλέον καθοδήγηση, προσφέρουμε προσωπικές συνεδρίες συμβουλευτικής",
    }
];


</script>

<template>
    <SectionLayout>
        <TheSectionHeader>
            <template #title>
                Έχεις ακόμη <strong class="text-primary">απορίες</strong>;
            </template>
            <template #description>
                Μπορεί να βρεις τις απαντήσεις στις πιο συχνές ερωτήσεις μας.
            </template>
        </TheSectionHeader>

        <div class="flex-1">
            <Accordion>
                <AccordionTab
                    v-for="(item, i) in faqList"
                    :key="i"
                    :header="item.question"
                >
                    <p class="line-height-3 m-0 p-0 text-md sm:text-xl">
                        {{ item.answer }}
                    </p>
                </AccordionTab>
            </Accordion>
        </div>
    </SectionLayout>
</template>

<style scoped>
    .p-accordion >>> .p-accordion-header {
        font-size: 1.2rem;
    }
</style>